tjaekel/STM32F769IDiscovery/Middlewares/ST/STM32_USB_Host_Library/Class/AUDIO/Src/usbh_audio.c
static void USBH_MIC_BufferCopy(uint8_t *micBuffer, int frmLenBytes, int isoRxBytes);

AUDIO_HandleTypeDef usbhAudioHandle;
//it should match with the EP size!
uint8_t audioInBuffer[/*48 * 2 * 3*/ 294] __attribute__ ((aligned (4)));	//ATT: max. 2048 size possible to do in USB_ReadPacket()
/* we have 48 KHz, 2 channels and 24bit audio from MIC = 288bytes, it has to be aligned for 32bit, if DMA is used */
unsigned int cnt;	//just to let flash an LED for reception, in 500ms intervall to toggle

/**
  * @}
  */

/** @defgroup USBH_AUDIO_CORE_Private_Functions
  * @{
  */

/**
  * @brief  USBH_AUDIO_InterfaceInit
  *         The function init the Audio class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_AUDIO_InterfaceInit (USBH_HandleTypeDef *phost)
{
  USBH_StatusTypeDef status = USBH_FAIL ;
  USBH_StatusTypeDef out_status, in_status ;
  AUDIO_HandleTypeDef *AUDIO_Handle;
  uint8_t  interface, index;
  uint16_t ep_size_out = 0U;
  uint16_t ep_size_in = 0U;

  interface = USBH_FindInterface(phost, AC_CLASS, USB_SUBCLASS_AUDIOCONTROL, 0x00U);

  if(interface == 0xFFU) /* Not Valid Interface */
  {
    USBH_DbgLog ("Cannot Find the interface for %s class.", phost->pActiveClass->Name);
    status = USBH_FAIL;
  }
  else
  {
    ////phost->pActiveClass->pData = (AUDIO_HandleTypeDef *)USBH_malloc (sizeof(AUDIO_HandleTypeDef));
	phost->pActiveClass->pData = &usbhAudioHandle;
    AUDIO_Handle =  (AUDIO_HandleTypeDef *)phost->pActiveClass->pData;
    USBH_memset(AUDIO_Handle, 0, sizeof(AUDIO_HandleTypeDef));

    /* 1st Step:  Find Audio Interfaces */
    out_status = USBH_AUDIO_FindAudioStreamingIN (phost);

    in_status = USBH_AUDIO_FindAudioStreamingOUT(phost);

    if((out_status == USBH_FAIL) && (in_status == USBH_FAIL))
    {
      USBH_DbgLog ("%s class configuration not supported.", phost->pActiveClass->Name);
    }
    else
    {
      /* 2nd Step:  Select Audio Streaming Interfaces with largest endpoint size : default behavior*/
      for (index = 0U; index < AUDIO_MAX_AUDIO_STD_INTERFACE; index ++)
      {
        if( AUDIO_Handle->stream_out[index].valid == 1U)
        {
          if(ep_size_out < AUDIO_Handle->stream_out[index].EpSize)
          {
            ep_size_out = AUDIO_Handle->stream_out[index].EpSize;
            AUDIO_Handle->headphone.interface = AUDIO_Handle->stream_out[index].interface;
            AUDIO_Handle->headphone.AltSettings = AUDIO_Handle->stream_out[index].AltSettings;
            AUDIO_Handle->headphone.Ep = AUDIO_Handle->stream_out[index].Ep;
            AUDIO_Handle->headphone.EpSize = AUDIO_Handle->stream_out[index].EpSize;
            AUDIO_Handle->headphone.Poll = (uint8_t)AUDIO_Handle->stream_out[index].Poll;
            AUDIO_Handle->headphone.supported = 1U;
          }
        }

        if( AUDIO_Handle->stream_in[index].valid == 1U)
        {
          if(ep_size_in < AUDIO_Handle->stream_in[index].EpSize)
          {
            ep_size_in = AUDIO_Handle->stream_in[index].EpSize;
            AUDIO_Handle->microphone.interface = AUDIO_Handle->stream_in[index].interface;
            AUDIO_Handle->microphone.AltSettings = AUDIO_Handle->stream_in[index].AltSettings;
            AUDIO_Handle->microphone.Ep = AUDIO_Handle->stream_in[index].Ep;
            AUDIO_Handle->microphone.EpSize = AUDIO_Handle->stream_in[index].EpSize;
            AUDIO_Handle->microphone.Poll = (uint8_t)AUDIO_Handle->stream_out[index].Poll;
            AUDIO_Handle->microphone.supported = 1U;
          }
        }
      }

      if(USBH_AUDIO_FindHIDControl(phost) == USBH_OK)
      {
        AUDIO_Handle->control.supported = 1U;
      }

      /* 3rd Step:  Find and Parse Audio interfaces */
      USBH_AUDIO_ParseCSDescriptors (phost);

      /* 4th Step:  Open the Audio streaming pipes*/
      if(AUDIO_Handle->headphone.supported == 1U)
      {
        USBH_AUDIO_BuildHeadphonePath (phost);

        AUDIO_Handle->headphone.Pipe  = USBH_AllocPipe(phost, AUDIO_Handle->headphone.Ep);

        /* Open pipe for IN endpoint */
        USBH_OpenPipe  (phost,
                        AUDIO_Handle->headphone.Pipe,
                        AUDIO_Handle->headphone.Ep,
                        phost->device.address,
                        phost->device.speed,
                        USB_EP_TYPE_ISOC,
                        AUDIO_Handle->headphone.EpSize);

        USBH_LL_SetToggle (phost, AUDIO_Handle->headphone.Pipe, 0U);
      }

      if(AUDIO_Handle->microphone.supported == 1U)
      {
        USBH_AUDIO_BuildMicrophonePath (phost);
        AUDIO_Handle->microphone.Pipe  = USBH_AllocPipe(phost, AUDIO_Handle->microphone.Ep);

        /* Open pipe for IN endpoint */
        USBH_OpenPipe  (phost,
                        AUDIO_Handle->microphone.Pipe,
                        AUDIO_Handle->microphone.Ep,
                        phost->device.address,
                        phost->device.speed,
                        USB_EP_TYPE_ISOC,
                        AUDIO_Handle->microphone.EpSize);

        USBH_LL_SetToggle (phost,  AUDIO_Handle->microphone.Pipe, 0U);
      }

      if(AUDIO_Handle->control.supported == 1U)
      {
        AUDIO_Handle->control.Pipe  = USBH_AllocPipe(phost, AUDIO_Handle->control.Ep);

        /* Open pipe for IN endpoint */
        USBH_OpenPipe  (phost,
                        AUDIO_Handle->control.Pipe,
                        AUDIO_Handle->control.Ep,
                        phost->device.address,
                        phost->device.speed,
                        USB_EP_TYPE_INTR,
                        AUDIO_Handle->control.EpSize);

        USBH_LL_SetToggle (phost,  AUDIO_Handle->control.Pipe, 0U);

      }

      AUDIO_Handle->req_state     = AUDIO_REQ_INIT;
      AUDIO_Handle->control_state = AUDIO_CONTROL_INIT;

      status = USBH_OK;
    }
  }
  return status;
}



/**
  * @brief  USBH_AUDIO_InterfaceDeInit
  *         The function DeInit the Pipes used for the Audio class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_AUDIO_InterfaceDeInit (USBH_HandleTypeDef *phost)
{
  AUDIO_HandleTypeDef *AUDIO_Handle =  (AUDIO_HandleTypeDef *) phost->pActiveClass->pData;

