tjaekel/STM32F769IDiscovery/Middlewares/ST/STM32_USB_Host_Library/Class/AUDIO/Src/usbh_audio.c
  if (ret != USBH_OK)
  {
    return ret;
  }

  phost->Control.setup.b.bmRequestType = USB_D2H | USB_REQ_RECIPIENT_INTERFACE | \
    USB_REQ_TYPE_CLASS;

  phost->Control.setup.b.bRequest = UAC_GET_MIN;
  phost->Control.setup.b.wValue.w = wValue;
  phost->Control.setup.b.wIndex.w = wIndex;
  phost->Control.setup.b.wLength.w = wLength;

  return(USBH_CtlReq(phost, (uint8_t *)(void *)(AUDIO_Handle->mem), wLength));

}

/**
  * @brief  Handle Set Endpoint Controls Request
  * @param  phost: Host handle
  * @param  Ep: Endpoint address
  * @param  buf: pointer to data
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_AUDIO_SetEndpointControls(USBH_HandleTypeDef *phost,
                                               uint8_t  Ep,
                                               uint8_t *buff)
{
  uint16_t wValue, wIndex, wLength;

  wValue = SAMPLING_FREQ_CONTROL << 8U;
  wIndex = Ep;
  wLength = 3U; /*length of the frequency parameter*/

  phost->Control.setup.b.bmRequestType = USB_H2D | USB_REQ_RECIPIENT_ENDPOINT | \
    USB_REQ_TYPE_CLASS;

  phost->Control.setup.b.bRequest = UAC_SET_CUR;
  phost->Control.setup.b.wValue.w = wValue;
  phost->Control.setup.b.wIndex.w = wIndex;
  phost->Control.setup.b.wLength.w = wLength;

  return(USBH_CtlReq(phost, (uint8_t *)buff, wLength));
}

static void __attribute__((section("ITCM"))) USBH_MIC_BufferCopy(uint8_t *micBuffer, int frmLenBytes, int isoRxBytes)
{
	/* copy the 24bit or 16bit, 48 KHz sample values into the output buffer */
	/* we have to make it static in order to have it on next call!
	 * we use isoRxBytes as indication for 24bit format
	 */
	static uint8_t *bufPtr = NULL;
	static uint8_t *prevBufPtr = NULL;
	static int offset = 0;
	static int bytes;
	static int init = 0;
	int i;

	HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_12);

	//if (isoRxBytes > 288)
	//	isoRxBytes = 288;

#if DEBUG_RODE_MIC
	if (isoRxBytes != 288)
		BSP_LED_Toggle(LED1);
#endif

	if (init < 2)
	{
		/* wait 2x for buffer sync, then let's start with the USB, almost in sync
		 * with the OUT buffer
		 */
		bytes = AUDIO_PLAYER_GetActiveBuffer(&prevBufPtr);
		if (bufPtr != prevBufPtr)
		{
			bufPtr = prevBufPtr;
			init++;
			offset = 0;
		}

		return;
	}

	/* check if the OUT buffer was changed - do it afterwards, option is to do it first on next call */
	if ( ! offset)
	{
		bytes = AUDIO_PLAYER_GetActiveBuffer(&bufPtr);
	}

	if ( ! isoRxBytes)
	{
		return;											//in case we have not received anything
	}

	for (i = 0; i < isoRxBytes; i += 3)
	{
		micBuffer++;
		*(bufPtr + offset + 0) = *micBuffer++;
		*(bufPtr + offset + 1) = *micBuffer++;

		offset += 2;

		if (offset >= bytes)
			break;
	}

	if (offset >= bytes)
		offset = 0;
}

/**
  * @brief  Handle Input stream process
  * @param  phost: Host handle
  * @retval USBH Status
  */
USBH_StatusTypeDef __attribute__((section("ITCM_RAM"))) USBH_AUDIO_InputStream (USBH_HandleTypeDef *phost)
{
	(void)phost;
	USBH_StatusTypeDef status = USBH_OK;
	uint32_t isoRxLen;
	static int xStatus = 0;

	/**
	 * We assume 48KHz
	 *
	 * 288bytes: 24bit, 2 channels, 48KHz = 288bytes
	 * 192bytes: 16bit, 2 channels, 48KHz = 192bytes
	 * ATT: 44.1 KHz would result in a variable length: 9x 176 bytes, on the 10th Rx 180 bytes?!
	 * Only 48KHz is nice, constant 192 (16bit) or 288 (24bit) samples per frame.
	 */
	AUDIO_HandleTypeDef *AUDIO_Handle;
	AUDIO_Handle = (AUDIO_HandleTypeDef *) phost->pActiveClass->pData;

	if ( ! xStatus)
	{
#if 1
		/**
		 * request 48KHz sample rate on ISO EP - do it once on first call here
		 * Remark: it does not make really a difference to get the 16bit 44.1/48KHz MIC to work
		 */
		static uint8_t outBuffer[3] = {0x80, 0xBB, 0x00};	//48000 Hz as little endian
		USBH_IsocSendData(phost, outBuffer, 3, AUDIO_Handle->microphone.Pipe);
#endif
		xStatus = 1;
		return status;
	}

	if (xStatus == 1)
	{
		/**
		 * ATT: this function returns immediately, it does not wait for reception!
		 * We assume, we kick it off here and it has finished on next call/entry here!
		 */
		status = USBH_IsocReceiveData(phost, audioInBuffer, AUDIO_Handle->microphone.EpSize, AUDIO_Handle->microphone.Pipe);
		xStatus = 2;

		return status;
	}

	if (xStatus == 2)
	{
	/*
	 * keep waiting until we have received the ISO Rx data
	 * ATTENTION: not really nice! It blocks our main thread (LCD!)!!!!
	 *
	 * But it does not work w/o to do!!!!
	 * Strange: actually every 1ms triggered/called here should have it available
	 * from previous time.
	 * Why we cannot speculate to kick-off one ISO Rx for next cycle and we copy data of previous
	 * cycle?
	 * Why we had to wait until the ISO Rx transfer was done????
	 */
#ifndef MIC16BIT
	do {
		/* get the length of previous ISO Rx data */
		/* we cannot use osDelay(1) for 1ms/1KHz here - it will be larger delay and too late */
		/*
		 * REMARK: it works only this way: we cannot assume to copy previous frame, calling code here every 1ms,
		 * it does not work.
		 * But if we wait like this, endless - the main thread (LCD, VUMeter, FFT), does not haver any chance to run,
		 * not a nicer solution:
		 * Better would be to split into two threads: first is the first part of this code, second thread is triggered
		 * by the INT handler, when ISO Rx was received and then do this copy of the result.
		 *
		 * It works for now on the miniDSP 24bit 48KHz MIC (only one alternative setting) and with this endless loop to
		 * wait for the ISO Rx data.
		 * It does NOT work for the 16bit, 44.1 or 48KHz (two alternatives) MIC!!!!
		 */
		isoRxLen = USBH_LL_GetLastXferSize(phost, AUDIO_Handle->microphone.Pipe);

		if ( ! isoRxLen)
		{
			//give other tasks a chance, but will not really help if this USB task has higher priority!
			taskYIELD();
		}
	} while ( ! isoRxLen);
#else
	/*
	 * VERY STRANGE: with 16bit, 2 channel MIC, with TWO (!!) alternatives as 44.1 or 48 KHz if FAILS:
	 * - the isoRxLen is always 0!
	 * - debugging code results in: we get all the time a CH_HALTED status (7), pktcnt is 0!!!
	 * - but we get some data if we ignore and copy anyway - a bit is working
	 * - it seems to be related to the TWO ALTERNAITVES of the MIC, potentially the wrong EP/pipe is confiured
	 *   (code looks for largest EP size, but potentially we run on the 'wrong' alternative)
	 * - it works fine with the 24bit 48KHz MIC which has just one ALTERNATIVE!
	 */
	{
		int i = 0;
		do {
			__NOP();
			i++;
		} while (i < 500);
	}
	isoRxLen = 192;
#endif

#ifdef TEST
	{
		/*
		 * this is just a test if the timing looks OK: we do all the USB but we copy the sine wave:
		 * it sounds OK, so that the USB INT handling and the timing, the time needed between two INTs, seems
		 * to be OK
		 */
		extern int TONEGEN_GetSine(const int16_t **buf);
		uint16_t *ptr;
		TONEGEN_GetSine(&ptr);

		USBH_MIC_BufferCopy((uint8_t *)ptr, 192);
	}
#else
	//48KHz, 16bit, stereo = 192 bytes - the format we can handle in all the other code!
	USBH_MIC_BufferCopy(audioInBuffer, 192, isoRxLen);

