tjaekel/STM32F769IDiscovery/Middlewares/ST/STM32_USB_Host_Library/Class/AUDIO/Src/usbh_audio.c
	//XXXX: release the audio out clock...

#endif
	xStatus = 1;
	}

	return status;
}

/**
  * @brief  Handle HID Control process
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef __attribute__((section("ITCM_RAM"))) USBH_AUDIO_Control (USBH_HandleTypeDef *phost)
{
  USBH_StatusTypeDef status = USBH_BUSY ;
  AUDIO_HandleTypeDef *AUDIO_Handle =  (AUDIO_HandleTypeDef*) phost->pActiveClass->pData;
  uint16_t attribute  = 0U;

  switch(AUDIO_Handle->control_state)
  {
  case AUDIO_CONTROL_INIT:
    if((phost->Timer & 1U) == 0U)
    {
      AUDIO_Handle->control.timer = phost->Timer;
      USBH_InterruptReceiveData(phost,
                                (uint8_t *)(void *)(AUDIO_Handle->mem),
                                (uint8_t)AUDIO_Handle->control.EpSize,
                                AUDIO_Handle->control.Pipe);

      AUDIO_Handle->temp_feature  = AUDIO_Handle->headphone.asociated_feature;
      AUDIO_Handle->temp_channels = AUDIO_Handle->headphone.asociated_channels;

      AUDIO_Handle->control_state = AUDIO_CONTROL_CHANGE ;
    }
    break;

  case AUDIO_CONTROL_CHANGE:
    if(USBH_LL_GetURBState(phost , AUDIO_Handle->control.Pipe) == USBH_URB_DONE)
    {
      attribute = LE16(&AUDIO_Handle->mem[0]);
      if(USBH_AUDIO_SetControlAttribute (phost, (uint8_t)attribute) == USBH_BUSY)
      {
        break;
      }
    }

    if(( phost->Timer - AUDIO_Handle->control.timer) >= AUDIO_Handle->control.Poll)
    {
      AUDIO_Handle->control.timer = phost->Timer;

      USBH_InterruptReceiveData(phost,
                                (uint8_t *)(void *)(AUDIO_Handle->mem),
                                (uint8_t)AUDIO_Handle->control.EpSize,
                                AUDIO_Handle->control.Pipe);

    }
    break;

  case AUDIO_CONTROL_VOLUME_UP:
       if( USBH_AUDIO_SetControlAttribute (phost, 1U) == USBH_OK)
       {
         AUDIO_Handle->control_state = AUDIO_CONTROL_INIT;
        status = USBH_OK;
       }
       break;

  case AUDIO_CONTROL_VOLUME_DOWN:
       if( USBH_AUDIO_SetControlAttribute (phost, 2U) == USBH_OK)
       {
         AUDIO_Handle->control_state = AUDIO_CONTROL_INIT;
         status = USBH_OK;
       }
       break;

  case AUDIO_CONTROL_IDLE:
  default:
    break;
  }

  return status;
}

/**
  * @brief  Handle Output stream process
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef __attribute__((section("ITCM_RAM"))) USBH_AUDIO_OutputStream (USBH_HandleTypeDef *phost)
{
  USBH_StatusTypeDef status = USBH_BUSY ;
  AUDIO_HandleTypeDef *AUDIO_Handle =  (AUDIO_HandleTypeDef*) phost->pActiveClass->pData;
  uint8_t *buff;


  switch(AUDIO_Handle->play_state)
  {
  case AUDIO_PLAYBACK_INIT:

    if( AUDIO_Handle->class_desc.as_desc[AUDIO_Handle->headphone.asociated_as].FormatTypeDesc->bSamFreqType == 0U)
    {
      AUDIO_Handle->play_state = AUDIO_PLAYBACK_SET_EP_FREQ;
    }
    else
    {
      AUDIO_Handle->play_state = AUDIO_PLAYBACK_SET_EP;
    }

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
    break;

  case AUDIO_PLAYBACK_SET_EP_FREQ:

    buff = (uint8_t*)AUDIO_Handle->class_desc.as_desc[AUDIO_Handle->headphone.asociated_as].FormatTypeDesc->tSamFreq[0];

    status = USBH_AUDIO_SetEndpointControls(phost, AUDIO_Handle->headphone.Ep, buff);
    if(status == USBH_OK)
    {
      AUDIO_Handle->play_state = AUDIO_PLAYBACK_IDLE;
    }
    break;

  case AUDIO_PLAYBACK_SET_EP:
    buff = (uint8_t *)(void *)&AUDIO_Handle->headphone.frequency;
    status = USBH_AUDIO_SetEndpointControls(phost,AUDIO_Handle->headphone.Ep, buff);
    if(status == USBH_OK)
    {
      AUDIO_Handle->play_state = AUDIO_PLAYBACK_IDLE;
      USBH_AUDIO_FrequencySet(phost);
    }
    break;

  case AUDIO_PLAYBACK_IDLE:
    status = USBH_OK;

#if (USBH_USE_OS == 1U)
    phost->os_msg = (uint32_t)USBH_CLASS_EVENT;
#if (osCMSIS < 0x20000U)
    (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
    (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
    break;

  case AUDIO_PLAYBACK_PLAY:
    USBH_AUDIO_Transmit(phost);
    status = USBH_OK;
    break;

  default:
    break;
  }

  return status;
}

/**
  * @brief  Handle Transmission process
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_AUDIO_Transmit (USBH_HandleTypeDef *phost)
{
  USBH_StatusTypeDef status = USBH_BUSY ;
  AUDIO_HandleTypeDef *AUDIO_Handle =  (AUDIO_HandleTypeDef*) phost->pActiveClass->pData;

  switch(AUDIO_Handle->processing_state)
  {
  case AUDIO_DATA_START_OUT:
    /* Sync with start of Even Frame */
    if((phost->Timer & 1U) == 0U)
    {
      AUDIO_Handle->headphone.timer = phost->Timer;
      AUDIO_Handle->processing_state = AUDIO_DATA_OUT;
      USBH_IsocSendData(phost,
                        AUDIO_Handle->headphone.buf,
                        (uint32_t)AUDIO_Handle->headphone.frame_length,
                        AUDIO_Handle->headphone.Pipe);

      AUDIO_Handle->headphone.partial_ptr = AUDIO_Handle->headphone.frame_length;
      AUDIO_Handle->headphone.global_ptr = AUDIO_Handle->headphone.frame_length;
      AUDIO_Handle->headphone.cbuf = AUDIO_Handle->headphone.buf;
    }
    else
    {

#if (USBH_USE_OS == 1U)
      osDelay(1);
      phost->os_msg = (uint32_t)USBH_CLASS_EVENT;

#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
    }
    break;

  case AUDIO_DATA_OUT:
    if((USBH_LL_GetURBState(phost , AUDIO_Handle->headphone.Pipe) == USBH_URB_DONE)&&
       (( phost->Timer - AUDIO_Handle->headphone.timer) >= AUDIO_Handle->headphone.Poll))
    {
      AUDIO_Handle->headphone.timer = phost->Timer;

      if(AUDIO_Handle->control.supported == 1U)
      {
        USBH_AUDIO_Control (phost);
      }

